Revit 2026 API

# BuiltInFailuresAutoJoinFailures Class

---

Failures about AutoJoin.

SystemObject Autodesk.Revit.DBBuiltInFailuresAutoJoinFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class AutoJoinFailures
```
```vb
Public NotInheritable Class AutoJoinFailures
```
```cpp
public ref class AutoJoinFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AutoJoinFailures = class end
```

The BuiltInFailuresAutoJoinFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DesignOptionAndWorksetViolation | Can't make the expected join because of editability and design option restrictions. |
|  | DesignOptionCannotReference | Design Option ' [Name] ' cannot reference Design Option ' [Name] '. |
|  | OtherNonEditJoinFailure | Two elements were not automatically joined because other elements at join are not editable. |
|  | UnexpectedJoinFailure | Join failure caused by editability or design option related problem. |
|  | Unknown | Unknown |
|  | WorksetJoinWarn | Two elements were not automatically joined because one or both is not editable. |

#### Reference

Autodesk.Revit.DB Namespace